/* REXX PROGRAM TO LIST FIRST 20 FIBONACCI NUMBERS */
F1 = 0
F2 = 1
SAY RIGHT(F1, 10)
SAY RIGHT(F2, 10)
DO I = 3 TO 20
  F3 = F1 + F2
  SAY RIGHT(F3, 10)
  F1 = F2
  F2 = F3
END
EXIT
